CylinderFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          9900;
        startFace       19700;
    }
    cylinder
    {
        type            wall;
        physicalType    patch;
        nFaces          100;
        startFace       29600;
    }
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          9900;
        startFace       29700;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       39600;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       39650;
    }
)

// ************************************************************************* //
