CylinderFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.01;

adjustTimeStep  yes;

maxCo           1.0;

writeControl    adjustableRunTime;

writeInterval   100.0;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fieldAverage
    {
        type fieldAverage;
        libs ("libfieldFunctionObjects.so");
        fields
        (
            rho
            {
                mean on;
                prime2Mean on;
                base time;
            }

            U
            {
                mean on;
                prime2Mean on;
                base time;
            }

            p
            {
                mean on;
                prime2Mean on;
                base time;
            }

            T
	    {
	      mean on;
	      prime2Mean on;
	      base time;
	    }
        );
        writeControl writeTime;
        writeInterval 1;
    }
}


// ************************************************************************* //
